Сделав домашнее задание по математике =))) я решил пойти погуглить задачи для новичков. Нашёл нужный мне сайт и начал чиркать.
1. Запрограммировать следующее выражение: (а + b — f / а) + f * a * a — (a + b) Числа а, b, f вводятся с клавиатуры. Организовать пользовательский интерфейс, таким образом, чтобы было понятно, в каком порядке должны вводиться числа.
Решение: 
#include <iostream>

using namespace std;

int main()
{
	setlocale(LC_ALL, "rus");
	int a;
	int b;
	int f;
	int x;
	std::cout << "Введите цифры a, b и f:";
	std::cin >> a;
	std::cout << "a:" << a;
	std::cin >> b;
	std::cout << "b:" << b;
	std::cin >> f;
	std::cout << "f:" << f;
	std::cout << "Вычисляем по формуле: x=(a + b - f / a) + f * a * a - (a + b)" << endl;
	x = (a + b - f / a) + f * a * a - (a + b);
	std::cout << "x=" << x;
}
2.Составить программу, которая будет считывать введённое пятизначное число. После чего, каждую цифру этого числа необходимо вывести в новой строке.
Решение:
#include <iostream>

using namespace std;

int main()
{
	setlocale(LC_ALL, "rus");
	int a;
	cout << "Введите число: ";
	cin >> a;
	cout << "Первая цифра: " << (a / 10000) % 10 << endl;
	cout << "Вторая цифра: " << (a / 1000) % 10 << endl;
	cout << "Третья цифра: " << (a / 100) % 10 << endl;
	cout << "Четвёртая цифра: " << (a / 10) % 10 << endl;
	cout << "Пятая цифра: " << a % 10 << endl;
	return 0;
}

00:11 На сегодня всё, пора спать, завтра в шкилу)
